In [ ]:
# 데이터프레임 행, 열 삭제하기

In [6]:
import pandas as pd

In [7]:
friends = [{'age':15, 'job': 'student'},
         {'age': 25, 'job': 'develper'},
         {'age': 30, 'job': 'teacher'}]

In [8]:
df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [9]:
df

       age       job
John    15   student
Jenny   25  develper
Nate    30   teacher

In [10]:
df.drop(['John', 'Nate'])

       age       job
Jenny   25  develper

In [11]:
df.drop(['John', 'Nate'], inplace=True)

In [12]:
df

       age       job
Jenny   25  develper

In [13]:
df = df[df.age > 20]

In [14]:
df

       age       job
Jenny   25  develper

In [15]:
friends = [{'name': 'John', 'age': 15, 'job': 'student'},
         {'name': 'Ben', 'age': 25, 'job': 'develper'},
         {'name': 'jenny', 'age': 30, 'job' : 'teacher'}]

In [16]:
df = pd.DataFrame(friends, columns = ['name', 'age', 'job'])

In [19]:
df

    name  age       job
0   John   15   student
1    Ben   25  develper
2  jenny   30   teacher

In [20]:
df2 = df.drop(df.index[[0,2]]) #Row 0과 2를 삭제

In [21]:
df2

  name  age       job
1  Ben   25  develper

In [35]:
df3 = df[df.age > 20]

In [36]:
df3

    name  age       job
1    Ben   25  develper
2  jenny   30   teacher

In [22]:
df4 = df.drop('age', axis=1)

In [23]:
df4

    name       job
0   John   student
1    Ben  develper
2  jenny   teacher

In [26]:
df = pd.DataFrame(friends,
                 index = ['John', 'Jenny', 'Nate'],
                 columns = ['age', 'job'])

In [27]:
df5 = df.drop('age', axis=1, inplace = True)

In [28]:
df5